using Microsoft.AspNetCore.Mvc;

namespace online_service_app_business_functions.Controllers
{
    [ApiController]
    [Route("[controller]/[action]")]
    public class MasterController : ControllerBase
    {

        //получение списка мастеров организации

        //прикрепление мастера к организации

        //получение информации о мастере по id

        //для мастера

        //редактирование информации о мастере (о себе)

        //создание рабочего дня мастера по умолчанию (настроек) сущность workday_by_default

        //создание новых рабочих дней, открытых для записи клиентов (сущность workday)

        //открепление мастера от организации 

        //получение списка существующих специализаций в системе

        //работа со специализациями? (добавление, редактирование, удаление)

    }
}