using Microsoft.AspNetCore.Mvc;

namespace online_service_app_business_functions.Controllers
{
    [ApiController]
    [Route("[controller]/[action]")]
    public class ServiceController : ControllerBase
    {

        //получение списка услуг организации

        //получение списка услуг, которые оказывает конктретный мастер

        //назначение мастеру списка услуг, которые он будет оказывать

        //редактирование списка услуг, которые оказывает данный мастер

        //получение списка мастеров, которые оказывают данную услугу

        //назначение списка мастеров, которые оказывают определенную услугу

        //редактирование списка мастеров, которые оказывают данную услугу

        //получение информации об услуге по id

        //для организации

        //добавление услуги

        //редактирование услуги 

        //удаление услуги

    }
}